Hello @JorgeBoscan, I am not sure if I am doing anything different but I was able to apply this without issues using Terraform `1.0.2` and localstack `latest` docker image.

Let me know if there is anything I need to do different. Cheers!

main.tf:
```
provider "aws" {
  region                      = "us-east-1"
  access_key                  = "mock_access_key"
  secret_key                  = "mock_secret_key"
  s3_force_path_style         = true
  skip_credentials_validation = true
  skip_metadata_api_check     = true
  skip_requesting_account_id  = true

  endpoints {
    s3 = "http://localhost:4566"
  }
}

locals {
  environment = "localstack"
  s3_buckets = [
    "test1",
    "test2",
  ]
}

resource "aws_s3_bucket" "s3_test_bucket" {
  count = "${length(local.s3_buckets)}"
  bucket = "${local.environment}-${element(local.s3_buckets, count.index)}"
}
```

Apply:
```
$ terraform apply -auto-approve
terraform apply -auto-approve;

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.s3_test_bucket[0] will be created
  + resource "aws_s3_bucket" "s3_test_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "localstack-test1"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # aws_s3_bucket.s3_test_bucket[1] will be created
  + resource "aws_s3_bucket" "s3_test_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "localstack-test2"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
aws_s3_bucket.s3_test_bucket[1]: Creating...
aws_s3_bucket.s3_test_bucket[0]: Creating...
aws_s3_bucket.s3_test_bucket[0]: Creation complete after 1s [id=localstack-test1]
aws_s3_bucket.s3_test_bucket[1]: Creation complete after 1s [id=localstack-test2]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
```

List buckets:
```
$ awslocal s3api list-buckets
{
    "Buckets": [
        {
            "Name": "localstack-test2",
            "CreationDate": "2021-07-24T03:49:40+00:00"
        },
        {
            "Name": "localstack-test1",
            "CreationDate": "2021-07-24T03:49:40+00:00"
        }
    ],
    "Owner": {
        "DisplayName": "webfile",
        "ID": "bcaf1ffd86f41161ca5fb16fd081034f"
    }
}
```